# Библиотека Pandas

## Data Frame

In [3]:
import pandas as pd

In [12]:
#создание DataFrame по столбцам с помощью словарей

frame=pd.DataFrame({'number':range(10),'chars':['a']*10})

In [13]:
frame

  chars  number
0     a       0
1     a       1
2     a       2
3     a       3
4     a       4
5     a       5
6     a       6
7     a       7
8     a       8
9     a       9

In [14]:
#создание DataFrame с помощью чтения данных из файла
#frame = pd.read_csv('dataset.tsv', header=0, sep='\t')
frame=pd.read_csv('dataset.tsv',header=0,sep='\t')

In [19]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [20]:
frame.columns

Index([u'Name', u'Birth', u'City', u'Position'], dtype='object')

In [21]:
frame.shape

(6, 4)

In [23]:
#new_line = {'Name':'Perov', 'Birth':'22.03.1990', 'City':'Penza'}
new_line={'Name':'Petrov','Birth':'21.02.1989','City':'Moscow'}

In [24]:
#добавление строки в DataFrame

frame.append(new_line,ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6           Petrov  21.02.1989     Moscow       NaN

In [26]:
#добавление строки в DataFrame
frame = frame.append(new_line, ignore_index=True)

In [27]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6           Petrov  21.02.1989     Moscow       NaN
7           Petrov  21.02.1989     Moscow       NaN

In [51]:
#добавление столбца в DataFrame
#frame['IsStudent'] = [False]*5 + [True]*2
frame['Employee']=

ValueError: Length of values does not match length of index

In [32]:
frame

              Name       Birth       City  Position Employee
0      Иванов А.А.  22.03.1980     Москва       NaN      Yes
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      Yes
2       Белов М.М.  13.02.1980     Ростов  менеджер      Yes
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      Yes
4      Рыбина Е.П.  19.11.1985     Москва   инженер      Yes
5     Костров С.О.  31.05.1985     Москва    стажер      Yes
6           Petrov  21.02.1989     Moscow       NaN      Yes
7           Petrov  21.02.1989     Moscow       NaN      Yes

In [33]:
#удаление строк DataFrame
#frame.drop([5,6], axis=0)
frame.drop([1,3],axis=0)

           Name       Birth    City  Position Employee
0   Иванов А.А.  22.03.1980  Москва       NaN      Yes
2    Белов М.М.  13.02.1980  Ростов  менеджер      Yes
4   Рыбина Е.П.  19.11.1985  Москва   инженер      Yes
5  Костров С.О.  31.05.1985  Москва    стажер      Yes
6        Petrov  21.02.1989  Moscow       NaN      Yes
7        Petrov  21.02.1989  Moscow       NaN      Yes

In [37]:
frame

              Name       Birth       City  Position Employee
0      Иванов А.А.  22.03.1980     Москва       NaN      Yes
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      Yes
2       Белов М.М.  13.02.1980     Ростов  менеджер      Yes
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      Yes
4      Рыбина Е.П.  19.11.1985     Москва   инженер      Yes
7           Petrov  21.02.1989     Moscow       NaN      Yes

In [38]:
#удаление строк DataFrame (inplace)
frame.drop([5,6], axis=0, inplace=True)

ValueError: labels [5 6] not contained in axis

In [36]:
frame

              Name       Birth       City  Position Employee
0      Иванов А.А.  22.03.1980     Москва       NaN      Yes
1     Сорокин И.В.  07.08.1965  Волгоград   инженер      Yes
2       Белов М.М.  13.02.1980     Ростов  менеджер      Yes
3  Мельникова Д.С.  15.04.1985     Ростов       NaN      Yes
4      Рыбина Е.П.  19.11.1985     Москва   инженер      Yes
7           Petrov  21.02.1989     Moscow       NaN      Yes

In [ ]:
#удаление столбца DataFrame (inplace)
frame.drop('IsStudent', axis=1, inplace=True)

In [ ]:
frame

In [ ]:
#запись DataFrame в файл
frame.to_csv('updated_dataset.csv', sep=',', header=True, index=False)

In [ ]:
!cat updated_dataset.csv

In [ ]:
#аналог команды для пользователей Windows
!more updated_dataset.csv